Repository: Melliv/Blood_donation_system
Catalog: Resources/DTO.App.V1/Overall.*.resx
Languages: et

source: Created by
et: Looja

# CreateAt
source: Created at
et: Loodud

source: Update by
et: Uuendaja

source: Updated at
et: Uuendatud

source: Blood test
et: Vereanalüüs

source: Person
et: Isik

source: Contact
et: Kontakt

source: Blood transfusion
et: Vereülekanne

source: Blood donate
et: Vere annetus

source: Contacts
et: Kontaktid

source: Persons
et: Isikud

source: Blood tests
et: Vereanalüüsid

source: Blood donates
et: Vere annetused

source: Blood transfusions
et: Vereülekanded

source: Blood to use
et: Kasutatav veri
